import json

dict_list = [
    {
        "관리기관":"서울구청",
        "소재지":"서울",
        "카메라대수":"1",
        "설치목적구분":"주차단속",
        "카메라화소수":"280"
    },
    {
        "관리기관":"부산구청",
        "소재지":"부산",
        "카메라대수":"2",
        "설치목적구분":"방범",
        "카메라화소수":"280"
    },
    {
        "관리기관":"대전구청",
        "소재지":"대전",
        "카메라대수":"1",
        "설치목적구분":"보호구역",
        "카메라화소수":"240"
    }
]
json_string = json.dumps(dict_list)

with open('cctv.json','w')as file:
    file.write(json_string)

print('cctv.json 파일이 생성되었습니다.')
